#**Module 01 | SQL Assignment**

---
#**Questions and Answers**
---

## 1. Create a table called employees with the following structure?
* emp_id (integer, should not be NULL and should be a primary key).
* emp_name (text, should not be NULL).
* age (integer, should have a check constraint to ensure the age is at least 18).
* email (text, should be unique for each employee).
* salary (decimal, with a default value of 30,000).

## Write the SQL query to create the above table with all constraints.

    create database Assignment; #name of Databse
    use Assignment;

    create table employees (
        emp_id int primary key,
        emp_name varchar(20) not null,
        age int check (age>=18),
        email varchar(40) unique,
        salary decimal(9,2) default 30000
    );

    select * from employees;

## 2. Explain the purpose of constraints and how they help maintain data integrity in a database. Provide examples of common types of constraints.

* SQL constraints are rules enforced on data columns in a table to limit the type of data that can be inserted or updated.

* Examples of comon types of constraints: unique, check, default, not null, primary key etc.

## 3. Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify your answer.

* NOT NULL constraints restricts user to insert or update NULL or 0 in the respective column of the table where it is applied.

* Primanry Key cannot contain NULL Values since it is combination of Unique and Not null.

## 4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an example for both adding and removing a constraint.

* Constraints can be removed by modifying the defination of the column or by dropping the constraint form the column.

* Steps to remove constraints from a column:
  #### <u>_MODIFY_</u> :
  * Use alter with modify command to modify column constraint or make it constraint free.
  e.g. ALTER TABLE Exployee
       MODIFY exp_id varchar(20);

  * In the above example emp_id constraint has been altered in table to constraint free from not null constraint. To verify the change 'DESCRIBE Exmployee' can be used.

  #### <u>_DROP_</u> :
    * Use alter with drop command to drop the constraint from the column or make it constraint free. Drop constrained is used to drop PRIMARY KEY, FOREIGN KEY, UNIQUE, and CHECK constraint from table.
  * e.g.
       * ALTER TABLE employee DROP FOREIGN KEY [Name of fkey_name];
       * ALTER TABLE employee DROP PRIMARY KEY;
       * ALTER TABLE employee DROP check [constraint_name];
       * ALTER TABLE employee DROP index [index_name];

  * In the above example emp_id constraint has been altered in table to constraint free from not null constraint. To verify the change 'DESCRIBE Exmployee' can be used.

## 5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints. Provide an example of an error message that might occur when violating a constraint.

### _Consequences_ :

* INSERT: If you insert data violating a constraint (e.g., duplicate in a primary key), the row will not be added.

* UPDATE: If you try to update a value that breaks a constraint (e.g., making a foreign key point to a non-existing parent record), the update fails.

* DELETE: If you delete a row that is referenced by a foreign key, the deletion will be blocked (unless ON DELETE CASCADE is set).

### _Example error messages_:

* Primary Key violation:

  ERROR: duplicate key value violates unique constraint "students_pkey"
  DETAIL: Key (student_id)=(101) already exists.


* Foreign Key violation:

  ERROR: insert or update on table "orders" violates foreign key constraint "orders_customerid_fkey"
  DETAIL: Key (customer_id)=(123) is not present in table "customers".


* Check constraint violation:

  ERROR: new row for relation "employees" violates check constraint "salary_check"
  DETAIL: Failing row contains (emp_id=5, name='Raj', salary=-5000).

## 6. You created a products table without constraints as follows:

    CREATE TABLE products (
        product_id INT,
        product_name VARCHAR(50),
        price DECIMAL(10, 2));

* Now, you realise that?
  * The product_id should be a primary key
  * The price should have a default value of 50.00

### > For adding PRIMARY KEY constraint on product_id column:
    ALTER TABLE products
    ADD CONSTRAINT P_key PRIMARY KEY (product_id);

### > For redefining price column with default value 50:
    ALTER TABLE products
    ALTER COLUMN price SET DEFAULT 50;

## 7. Write a query to fetch the student_name and class_name for each student using an INNER JOIN.

  ### Code:
    select
      student_name,
      class_name from
    students as s inner join
    class as c on s.class_id=c.class_id;

## 8. Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are listed even if they are not associated with an order

  ### Code:
    select
      p.product_name,
      o.order_id,c.customer_name
    from products p
    left join orders o on p.order_id=o.order_id
    left join customers c on o.customer_id=c.customer_id;

## 9. Write a query to find the total sales amount for each product using an INNER JOIN and the SUM() function.

  ### Code:
    
    select p.product_name,
           sum(s.amount) as total_sales_amount
    from products p
    inner join sales s on p.product_id = s.product_id
    group by p.product_name;

## 10. Write a query to display the order_id, customer_name, and the quantity of products ordered by each customer using an INNER JOIN between all three tables.

  ### Code:
    
    select
        o.order_id,
        c.customer_name,
        sum(Quantity) as qunatity_of_product
    from orders o inner join customers c
    on o.customer_id=c.customer_id
    inner join orderdetails od
    on o.order_id=od.order_id
    group by order_id;

---
#**SQL Commands**
---

## 1. Identify the primary keys and foreign keys in mavenmovies db. Discuss the differences.

#### Differeences between Primary and Foreign Key:

  <u>Primary Key:</u>
  * Primary key column/attribute of a table/an entity takes values which are unique and are not null.

  <u>Foreign Key:</u>
  * Foreign Key column/attribute of a table/an entity are use dto create link between two tables. Where, the table which is using another table as reference is calles as Child table and the table which is being Referenced is called Parent table.
  * The link is only possible when a primary colum is used from paratent table for referencing whereas child table can have duplicate values in referenced (foreign) column.
  * The foreign key column in child table cannot have a value which is not part of Parent tables referenced column. The query will throw error.

## Code:

#### Primary Key:

    select
        table_name,
        constraint_name,
        column_name
    from information_schema.key_column_usage
    where constraint_name='primary' and table_schema='mavenmovies'
    order by table_name;

#### Foreign Key:

    select
	  table_name,
      constraint_name,
      referenced_table_name,
      referenced_column_name
    from information_schema.key_column_usage
    where table_schema='sakila' and referenced_table_name is not Null
    order by table_name;

## 2. List all details of actors.

### Code:

    select * from actor;

## 3. List all customer information from DB.

### Code:

    select * from customer;

## 4. List different countries.

### Code:

    select distinct * from country;

## 5. Display all active customers.

### Code:

    select * from customer where active=1;

## 6. List of all rental IDs for customer with ID 1

### Code:
    select * from rental where customer_id=1

## 7. Display all the films whose rental duration is greater than 5.

### Code:

    select * from film where rental_duration>5;

## 8. List the total number of films whose replacement cost is greater than 15 USD and less than 20 USD.

### Code:

    select * from film where replacement_cost between 15 and 20;

## 9. Display the count of unique first names of actors.

### Code:
    select distinct(first_name) from actor;

## 10. Display the first 10 records from the customer table

### Code:

    select * from customer limit 10;

## 11. Display the first 3 records from the customer table whose first name starts with ‘b’.

### Code:

    select * from customer where first_name like 'b%' limit 3;

## 12. Display the names of the first 5 movies which are rated as ‘G’.

### Code:
    select * from film where rating='G';

## 13. Find all customers whose first name starts with "a".

### Code:

    select * from customer where first_name 'a%';

## 14.  Find all customers whose first name ends with "a".

### Code:

    select * from customer where first_name '%a';

## 15.  Display the list of first 4 cities which start and end with ‘a’

### Code:

    select * from customer where first_name like 'a%' and first_name like '%a';

## 16. Find all customers whose first name have "NI" in any position.

### Code:

    select * from customer where first_name like '%NI%';

## 17. Find all customers whose first name have "r" in the second position .

### Code:

    select * from customer where first_name like '_r%';

## 18. Find all customers whose first name starts with "a" and are at least 5 characters in length.

### Code:
    select * from customer where first_name like 'a%' and length(first_name)>=5;

## 19. Find all customers whose first name starts with "a" and ends with "o".

### Code:

    select * from customer where first_name like 'a%' and first_name like '%o'

## 20. Get the films with pg and pg-13 rating using IN operator

### Code:
    select * from film where rating in ('pg','pg-13');

## 21. Get the films with length between 50 to 100 using between operator.

### Code:
    select * from film where length between 50 and 100;

## 22.  Get the top 50 actors using limit operator.

### Code:
    selct * from actor limit 50;

## 23.  Get the distinct film ids from inventory table.

### Code:
    select distinct * from film;

---
#**Functions**
---

# **Basic Aggregate Functions:**

## 1. Retrieve the total number of rentals made in the Sakila database.

### Code:

    select
      count(distinct rental_id)
    from rental where rental_id is not null;

## 2. Find the average rental duration (in days) of movies rented from the Sakila database.

### Code:

    select avg(date(return_date) - date(rental_date)) as avg_rent_duration from rental;

## 3. Display the first name and last name of customers in uppercase.

### Code:

    select
      upper(first_name) as First_name,
      upper(last_name) as Last_name
    from customer;

## 4. Extract the month from the rental date and display it alongside the rental ID.

### Code:

    select
      rental_id,
      month(rental_date) as rental_month
    from rental;

# **Group by:**

## 5. Retrieve the count of rentals for each customer (display customer ID and the count of rentals).

### Code:
    
    select
      customer_id,
      count(rental_id) as rental_count
    from rental group by customer_id;

## 6. Find the total revenue generated by each store.

### Code:

    select
      staff_id,
      sum(amount) as revenue_by_staff
    from payment group by staff_id;

## 7. Determine the total number of rentals for each category of movies.

### Code:

    select
      name as category_name,
      count(rental_rate) total_cat_rentals
    from film_category fc
    left join category c on fc.category_id=c.category_id
    left join film f on f.film_id=fc.film_id
    group by category_name;

## 8. Find the average rental rate of movies in each language.

### Code:

    select
      name as lang_name,
      round(avg(rental_rate),3) as avg_rental_rate
    from film f left
    join language l on f.language_id=l.language_id
    group by name;

---
#**Joins**
---

## 9. Display the title of the movie, customer's first name, and last name who rented it.

### Code:

    select
      f.title as Movie_title,
      concat(c.first_name," ", c.last_name) as Customer_name
    from inventory i
    join film f on i.film_id=f.film_id
    join customer c on i.store_id=c.store_id
    join rental r on c.customer_id=r.customer_id;

## 10.Retrieve the names of all actors who have appeared in the film "Gone with the Wind."

### Code:

    select
	    concat(first_name,' ',last_name) as Actor_Name,
	    Title
    from film_actor fa
    left join actor a on fa.actor_id=a.actor_id
    left join film f on fa.film_id=f.film_id
    where title="Gone with the wild";

## 11. Retrieve the customer names along with the total amount they've spent on rentals.

### Code:

    select
	      concat(first_name, ' ' ,last_name) as Customer_name,
          sum(amount)
    from customer c
    join payment p on c.customer_id=p.customer_id
    group by Customer_name;

## 12. List the titles of movies rented by each customer in a particular city (e.g., 'London').

### Code:

    select
        title as Movie_Title,
        concat(first_name, ' ' ,last_name) as Customer_Name,
        city as Rental_City
    from customer c
    join rental r on r.customer_id=c.customer_id
    join inventory i on i.inventory_id=r.inventory_id
    join film f on f.film_id=i.film_id
    join address a on a.address_id=c.address_id
    join city ci on ci.city_id=a.city_id
    where ci.city = 'Bhopal'
    group by Customer_Name, Rental_City, Movie_Title
    order by Customer_Name, Movie_Title;

Note: This gives count of distinct customer_names as 599 as output which is equal to the count of distinct customer_names in "Customer" table, Hence code validated.

### Code:


    with final_table as (
          select
	      title as Movie_Title,
	      concat(first_name, ' ' ,last_name) as Customer_Name,
          city as Rental_City
    from customer c
    join rental r on r.customer_id=c.customer_id
    join inventory i on i.inventory_id=r.inventory_id
    join film f on f.film_id=i.film_id
    join address a on a.address_id=c.address_id
    join city ci on ci.city_id=a.city_id
    where ci.city = 'Bhopal'
    group by Customer_Name, Rental_City, Movie_Title
    order by Customer_Name, Movie_Title)
    select count(distinct Customer_Name) from final_table;

---
#**Advanced Joins and GROUP BY:**
---

## 13. Display the top 5 rented movies along with the number of times they've been rented.

  ### Code:
  
    select
      title,
      count(customer_id) as times_rented
    from film f
    join inventory i on f.film_id=i.film_id
    join rental r on i.inventory_id=r.inventory_id
    group by title
    order by times_rented desc
    limit 5;

## 14. Determine the customers who have rented movies from both stores (store ID 1 & store ID 2).


 ### Code:

    select
        concat(first_name, ' ',last_name) as Customer_name,
        count(distinct i.store_id) as store_count
    from customer c
    join rental r on c.customer_id=r.customer_id
    join inventory i on i.inventory_id=r.inventory_id
    group by customer_name
    having count(distinct i.store_id) = 2;

---
#**Window Functions**
---

## 1. Rank the customers based on the total amount they've spent on rentals.

 ### Code:
    
   
    select
        c.customer_id,
        concat(first_name, ' ', last_name) as Customer_name,
        sum(f.rental_rate*f.rental_duration) as Total_amount,
        rank() over(order by sum(f.rental_rate*f.rental_duration) desc) as Rank_of_Total
    from customer c
    join rental r on c.customer_id=r.customer_id
    join inventory i on r.inventory_id=i.inventory_id
    join film f on f.film_id=i.film_id
    group by c.customer_id
    limit 5;

## 2.  Calculate the cumulative revenue generated by each film over time.

###Code:

    select
       f.title,
       date(p.payment_date) as Payment_date,
       sum(p.amount) over (partition by f.title order by date(p.payment_date) rows between unbounded preceding and current row) as Cumelative_amount
    from payment p
    join rental r on p.rental_id=r.rental_id
    join inventory i on r.inventory_id=i.inventory_id
    join film f on i.film_id=f.film_id;

## 3. Determine the average rental duration for each film, considering films with similar lengths.

###Code:

    select
	    f.title,
	    round(avg(datediff(return_date, rental_date))
        over (partition by f.length),2) as Avg_rent_duration
    from rental r
    join inventory i on r.inventory_id=i.inventory_id
    join film f on i.film_id=f.film_id;

## 4. Identify the top 3 films in each category based on their rental counts.

### Code:

    with final_table as(select
        f.title,
        fc.category_id as category_id,
        count(r.rental_id) as rental_count,
        row_number() over(partition by fc.category_id order by count(r.rental_id)desc) as ranking
    from rental r
    join inventory i on r.inventory_id=i.inventory_id
    join film f on i.film_id=f.film_id
    join film_category fc on f.film_id=fc.film_id
    group by f.title, fc.category_id) select * from final_table where ranking<=3;

## 5.  Calculate the difference in rental counts between each customer's total rentals and the average rentals across all customers.

### Code:

    select
        concat(first_name, ' ', last_name) as customer_name,
        count(r.rental_id) as rental_count,
        round(avg(count(r.rental_id)) over(),2) as overall_avg,
        count(r.rental_id) - round(avg(count(r.rental_id)) over(),2) as difference_of_actual_avg
    from rental r
    join customer c on r.customer_id=c.customer_id
    group by customer_name
    order by rental_count desc;

## 6. Find the monthly revenue trend for the entire rental store over time.

###Code:

    select
      year(p.payment_date) as year_,
      monthname(p.payment_date) as month_,
      sum(p.amount) over(partition by year(p.payment_date), month(p.payment_date)) as revenue_per_month
    from payment p
    join rental r on p.rental_id=r.rental_id
    join inventory i on r.inventory_id=i.inventory_id
    order by year(p.payment_date), month(p.payment_date);

## 7. Identify the customers whose total spending on rentals falls within the top 20% of all customers.

###Code:
    
    select * from (select
        c.customer_id,
        concat(first_name, ' ', last_name) as Customer_name,
        sum(f.rental_rate*f.rental_duration) as Total_amount,
        rank() over(order by sum(f.rental_rate*f.rental_duration) desc) as Rank_of_Total,
        count(*) over() as Total_Customer
    from customer c
    join rental r on c.customer_id=r.customer_id
    join inventory i on r.inventory_id=i.inventory_id
    join film f on f.film_id=i.film_id
    group by c.customer_id) as final_table
    where Rank_of_Total<=floor(Total_Customer*0.2)
    order by Rank_of_Total;

## 8. Calculate the running total of rentals per category, ordered by rental count.

###Code:

    select
      *,
      count(category_name) over(partition by category_name) as rental_count
    from (
      select
	  name as category_name,
      rental_rate as rental_price,
	  sum(rental_rate) over(partition by name rows between unbounded preceding and current row
      ) as cum_cat_rentals
    from film_category fc
    left join category c on fc.category_id=c.category_id
    left join film f on f.film_id=fc.film_id) as final_table
    order by category_name;

## 9. Find the films that have been rented less than the average rental count for their respective categories.

  ###Code:
    
    select * from (select
        f.title as film_title,
        c.name as category_name,
        count(r.rental_id) as rental_count,
        round(avg(count(r.rental_id)) over(partition by fc.category_id),2) as category_avg_rental_count
    from rental r
    join inventory i on r.inventory_id=i.inventory_id
    join film f on i.film_id=f.film_id
    join film_category fc on f.film_id=fc.film_id
    join category c on fc.category_id=c.category_id
    group by f.title, fc.category_id) as final_table where rental_count< category_avg_rental_count
    order by category_name;

## 10. Identify the top 5 months with the highest revenue and display the revenue generated in each month.

  ### Code:
    
    select * from (select
      year(p.payment_date) as year_no,
      month(payment_date) as month_no,
      monthname(p.payment_date) as month_name,
      sum(p.amount) as revenue_per_month,
      dense_rank() over(order by sum(p.amount) desc) as ranking
    from payment p
    join rental r on p.rental_id=r.rental_id
    join inventory i on r.inventory_id=i.inventory_id
    group by year(p.payment_date), month(payment_date), monthname(p.payment_date)
    order by ranking, month(p.payment_date)) as final_table where ranking<=5;

---
#**Normalisation & CTE**
---

## 1. First Normal Form (1NF):
#### Identify a table in the Sakila database that violates 1NF. Explain how you would normalize it to achieve 1NF.

Ans: The Sakila database is completely Noamalized. Hence there are no entity/table that has to be normalized. However, in general to normalize a non-1NF table to 1NF following logic can be applied:
  * Identify the table and attribute/column which has non atomic values stored.
  * Separete the values using delimiter.
  * For each new value duplicate other column values to create a new record.

## 2. Second Normal Form (2NF):

#### Choose a table in Sakila and describe how you would determine whether it is in 2NF. If it violates 2NF, explain the steps to normalize it.

## 3. Third Normal Form (3NF):

#### Identify a table in Sakila that violates 3NF. Describe the transitive dependencies present and outline the steps to normalize the table to 3NF.

## 4. Normalization Process:

#### Take a specific table in Sakila and guide through the process of normalizing it from the initial unnormalized form up to at least

## 5. CTE Basics:
#### Write a query using a CTE to retrieve the distinct list of actor names and the number of films they have acted in from the actor and film_actor tables.

   ### Code:
      
    with cte_films_count as
        (select
          concat(first_name, ' ' ,last_name) as actor_name,
          count(film_id) as films_count
        from actor a join film_actor fa on a.actor_id=fa.actor_id
        group by a.actor_id
        order by films_count)
    select * from cte_films_count;

## 6. CTE with Joins:

 #### Create a CTE that combines information from the film and language tables to display the film title, language name, and rental rate.

  ### Code:
   
    with cte_combine_info as
	      (select
		  f.title as film_title,
		  l.name as language_name,
		  f.rental_rate
	      from film f join language l on f.language_id=l.language_id)
    select * from cte_combine_info;

## 7. CTE for Aggregation:


 #### Write a query using a CTE to find the total revenue generated by each customer (sum of payments) from the customer and payment tab

### Code:
    
    with cte_total_rev as
      (select
        concat(c.first_name,' ', c.last_name) as customer_name,
        sum(p.amount) as total_rev_generated
      from payment p join customer c on p.customer_id=c.customer_id
      group by customer_name
      order by total_rev_generated desc)
    select * from cte_total_rev;

## 8. CTE with Window Functions:

 #### Utilize a CTE with a window function to rank films based on their rental duration from the film table.

### Code:

    with cte_ranking as
      (select
        film_id,
        title,
        rental_duration,
        dense_rank() over(order by rental_duration desc) as ranking
      from film)
    select * from cte_ranking;

## 9. CTE and Filtering:

 #### Create a CTE to list customers who have made more than two rentals, and then join this CTE with the customer table to retrieve additional customer details.

### Code:

    with cte_rental_count as
        (select
		        c.customer_id as customer_id,
		        concat(c.first_name,' ', c.last_name) as customer_name,
		        count(rental_id) as rental_count
	      from rental r join customer c on r.customer_id=c.customer_id
	      group by c.customer_id
	      )
    select
	    cte.customer_id as customer_id,
        cte.customer_name,
        c.email,
        cte.rental_count
    from customer c join cte_rental_count cte
    on c.customer_id=cte.customer_id
    where rental_count>20;

## 10.  CTE for Date Calculations:

 #### Write a query using a CTE to find the total number of rentals made each month, considering the rental_date from the rental table.

### Code:

    with cte_monthly_rental as
	      (select
          year(rental_date) as _year_,
          month(rental_date) as _month_,
          count(rental_id) as rental_nos
        from rental
        group by _month_, _year_)
    select * from cte_monthly_rental;

## 11.  CTE and Self-Join:

 #### Create a CTE to generate a report showing pairs of actors who have appeared in the same film together, using the film_actor table.

### Code:


    with cte_pair_actors as
	    (select
		    f1.film_id,
		    f1.actor_id as actor_1,
		    f1.actor_id as actor_2
	    from film_actor f1 join film_actor f2
	    on f1.film_id=f2.film_id
	    where f1.actor_id<f2.actor_id)
    select * from cte_pair_actors;

## 12. CTE for Recursive Search:

#### Implement a recursive CTE to find all employees in the staff table who report to a specific manager, considering the reports_to column

### Code:
#### Note: Where clause value in anchor query decides the output.

--------- EMPLOYEE MANAGER TABLE -----------------

    create table staff2 (
        staff_id int primary key,
        name varchar(50),
        reports_to int
    );

    insert into staff2 (staff_id, name, reports_to) values
    (1, 'alice', null),
    (2, 'bob', 1),
    (3, 'carol', 1),
    (4, 'david', 2),
    (5, 'emma', 2),
    (6, 'frank', 3),
    (7, 'grace', 3),
    (8, 'helen', 4),
    (9, 'ian', 5),
    (10, 'jack', 6),
    (11, 'kate', null),
    (12, 'leo', 11),
    (13, 'mona', 11),
    (14, 'nick', 13),
    (15, 'olivia', 13);

--------- RECURSIVE CTE -----------------

    with recursive cte_staff2 as(
      select
        staff_id,
        name,
        reports_to
      from staff2
      where staff_id=11
        
      union all
        
      select
        s.staff_id,
        s.name,
        s.reports_to
      from staff2 as s
      join cte_staff2 cte
      on s.reports_to=cte.staff_id)
    select * from cte_staff2;